test/5.5_req.xml

<?xml version='1.0' ?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing">
	<soap:Header>
		<wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/PrinterStatusSummaryEvent</wsa:Action>
		<wsa:MessageID>urn:uuid:53b50980-4376-11b2-a9f5-7438b71cb2c4</wsa:MessageID>
		<wsa:To>http://192.168.1.101:5357/eea57bfa-43bd-40ef-9598-b2d7cb81cd95</wsa:To>
		<wse:Identifier>urn:uuid:46fe4359-71c6-4c25-8418-1eb595a2228d</wse:Identifier>
	</soap:Header>
	<soap:Body>
		<wprt:PrinterStatusSummaryEvent>
			<wprt:StatusSummary>
				<wprt:PrinterState>Processing</wprt:PrinterState>
				<wprt:PrinterPrimaryStateReason>None</wprt:PrinterPrimaryStateReason>
				<wprt:PrinterStateReasons>
					<wprt:PrinterStateReason>None</wprt:PrinterStateReason>
				</wprt:PrinterStateReasons>
			</wprt:StatusSummary>
		</wprt:PrinterStatusSummaryEvent>
	</soap:Body>
</soap:Envelope>
